In [99]:
import pandas as pd

In [2]:
import pandas as  pd 

#'/Users/rubenmartinezlorente/data-bcn-prework/DATA_COURSE/PROJECTS/P2_Barcelona/Project-Week-2-Barcelona/datasets/3.-Population/births.csv')
##files to read

birth = pd.read_csv('../Project-Week-2-Barcelona/datasets/3.-Population/births.csv')
death = pd.read_csv('../Project-Week-2-Barcelona/datasets/3.-Population/deaths.csv')
population = pd.read_csv('../Project-Week-2-Barcelona/datasets/3.-Population/population.csv')
babies = pd.read_csv('../Project-Week-2-Barcelona/datasets/3.-Population/most-frequent-baby-names.csv')
names = pd.read_csv('../Project-Week-2-Barcelona/datasets/3.-Population/most-frequent-names.csv')

In [9]:
names.head()

   Order        Name  Gender       Decade  Frequency
0      1       MARIA  Female  Before 1930       2085
1      2      CARMEN  Female  Before 1930       1463
2      3      JOSEFA  Female  Before 1930       1032
3      4  MONTSERRAT  Female  Before 1930        879
4      5        ROSA  Female  Before 1930        762

            ## What is the most  female frequent name in this century 
names.head()                                                 
#names.columns
#names.Decade.unique()
names_total_F = names.loc[(names.Decade == 'TOTAL') & (names_total.Gender == 'Female')].loc[:,['Name','Frequency']]
names_total_F
#.sort_values('Frequency', ascending = True)
#names_total_F.max()


#names_total_M = names.loc[(names.Decade == 'TOTAL') & (names.Gender == 'Male')].loc[:,['Name', 'Frequency']]
#names_total_M.sort_values('Frequency', ascending = False)
#names_total_M.min()

In [51]:
            ## What is the most  male frequent name in this century 


names_total_M = names.loc[(names.Decade == 'TOTAL') & (names.Gender == 'Male')].loc[:,['Name', 'Frequency']]
names_total_M.sort_values('Frequency', ascending = False)
#names_total_M.min()

                  Name  Frequency
1050           ANTONIO      16709
1051              JOSE      15740
1052             JORDI      13723
1053             DAVID      12528
1054            MANUEL      12453
1055         FRANCISCO      12133
1056            CARLOS      10866
1057              JUAN      10760
1058              MARC      10099
1059            DANIEL       9715
1060            JAVIER       8387
1061             JORGE       8149
1062              JOAN       7211
1063         ALEJANDRO       6819
1064            MIGUEL       6438
1065             RAMON       6390
1066            ALBERT       6248
1067              LUIS       6108
1068             PEDRO       5933
1069            XAVIER       5869
1070            VICTOR       5818
1071            SERGIO       5640
1072           ALBERTO       5635
1073             JOSEP       5376
1074             OSCAR       5070
1075            RAFAEL       4883
1076          FERNANDO       4837
1077             ANGEL       4567
1078              ALEX       4448
1079           ENRIQUE       4439
1080            JOSE M       4367
1081  FRANCISCO JAVIER       4218
1082             JESUS       4132
1083               PAU       3993
1084             PABLO       3954
1085             JAIME       3939
1086         JOSE LUIS       3912
1087               POL       3855
1088             ORIOL       3701
1089           JOAQUIN       3663
1090          SANTIAGO       3547
1091           EDUARDO       3519
1092             SERGI       3456
1093              IVAN       3285
1094             JAUME       3204
1095              RAUL       3146
1096        JOSE MARIA       3140
1097      JOSE ANTONIO       2994
1098           RICARDO       2991
1099            GERARD       2988